DataProcessors/УДАЛИТЬ_МониторыРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>УДАЛИТЬ_МониторыРуководителя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Замеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Замеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Замер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Невыходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамерВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗамерщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтсутствиеИсполнителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыЗамера</v8:Type>
						<v8:Type>cfg:CatalogRef.РезультатЗамераЛида</v8:Type>
						<v8:Type>cfg:CatalogRef.РезультатыВыездаЛида</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказаЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Геометка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНазначенияЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументЗамер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗамера</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначилЗамер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначилЗамерПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Монтажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Монтажи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Монтаж</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыМонтажа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Геометка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументМонтаж</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДМонтажа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияСтатусовЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовЛидов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЛида</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/УДАЛИТЬ_НастройкиМонитораПульсРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УДАЛИТЬ_НастройкиМонитораПульсРозницы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>КассыДляОтбораВВыручку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/УДАЛИТЬ_МониторыРуководителя/Forms/ПульсБизнесаРозница/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаПоказатели.Видимость = ПараметрыСеанса.ТекущийПользователь.ДоступенМониторПульсБизнесаРозница;
	
	Если НЕ ПараметрыСеанса.ТекущийПользователь.ДоступенМониторПульсБизнесаРозница Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "";
	КонецЕсли;
	
	Элементы.ЗапуститьОтчет.Видимость = ПравоДоступа("Просмотр", Метаданные.Отчеты.ПульсБизнесаРозница);
	
	НастройкаМонитора = ПараметрыСеанса.ТекущийПользователь.ИспользуемаяНастройкаМонитораПульсРозницы;
	Если НастройкаМонитора.Пустая() Тогда
		НастройкаМонитора = Справочники.УДАЛИТЬ_НастройкиМонитораПульсРозницы.НастройкаПоУмолчанию;
	КонецЕсли;
			
	//Для Сч = 1 По 8 Цикл
	//	Элементы["ГруппаВыручка"+Сч].Видимость = Ложь;
	//КонецЦикла;	
	
	ОбновитьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьОтчет();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтчет()
	
	ТДата = НачалоДня(ТекущаяДатаСеанса() - 6*86400);
	
	СписокКассДляВыручки = Новый СписокЗначений;
	Для каждого СтрокаКассы из НастройкаМонитора.КассыДляОтбораВВыручку Цикл
		СписокКассДляВыручки.Добавить(СтрокаКассы.Касса);
	КонецЦикла;	
	ИспользоватьОтборПоКассам = СписокКассДляВыручки.Количество() > 0;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ТДата);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СписокКассДляВыручки", СписокКассДляВыручки);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоКассам", ИспользоватьОтборПоКассам);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Лид.Дата, ДЕНЬ) КАК Дата,
	|	КОЛИЧЕСТВО(1) КАК Статус
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен
	|	И Лид.Дата >= &НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Лид.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Лид.Дата, ДЕНЬ) КАК Дата,
	|	КОЛИЧЕСТВО(1) КАК Статус
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен
	|	И Лид.Дата >= &НачалоПериода
	|	И Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.Отказ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Лид.Дата, ДЕНЬ)
	|;		
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Лид.Дата, ДЕНЬ) КАК Дата,
	|	КОЛИЧЕСТВО(1) КАК Статус
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен
	|	И Лид.Дата >= &НачалоПериода
	|	И Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НеЦелевой)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Лид.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Лид.Дата, ДЕНЬ) КАК Дата,
	|	КОЛИЧЕСТВО(1) КАК Статус
	|ИЗ
	|	Документ.Лид КАК Лид
	|ГДЕ
	|	Лид.Проведен
	|	И Лид.Дата >= &НачалоПериода
	|	И НЕ Лид.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЛида.НеЦелевой)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Лид.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ				
	|	КОЛИЧЕСТВО	(1) КАК КоличествоЗамеров,
	|	НАЧАЛОПЕРИОДА(Замеры.Дата, ДЕНЬ) КАК Дата
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Дата >= &НачалоПериода
	|	И Замеры.Дата <= &КонецПериода
	|	И НЕ Замеры.ЭтоВыезд
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Замеры.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ				
	|	КОЛИЧЕСТВО	(1) КАК КоличествоЗамеров,
	|	НАЧАЛОПЕРИОДА(Замеры.ДатаНазначенияЗамера, ДЕНЬ) КАК Дата
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Замеры.ДатаНазначенияЗамера, ДЕНЬ) >= &НачалоПериода
	|	И НАЧАЛОПЕРИОДА(Замеры.ДатаНазначенияЗамера, ДЕНЬ) <= &КонецПериода
	|	И НЕ Замеры.ЭтоВыезд
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Замеры.ДатаНазначенияЗамера, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ЗаказДоговоры.Дата, ДЕНЬ) КАК Дата,
	|	СУММА(ЗаказДоговоры.СуммаДокумента) КАК СуммаДоговоров,
	|	КОЛИЧЕСТВО(1) КАК КоличествоДоговоров
	|ИЗ
	|	Документ.ЗаказДоговор КАК ЗаказДоговоры
	|ГДЕ
	|	ЗаказДоговоры.Дата >= &НачалоПериода
	|	И ЗаказДоговоры.Дата <= &КонецПериода
	|	И ЗаказДоговоры.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ЗаказДоговоры.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ДенежныеСредства.Период, ДЕНЬ) КАК Дата,
	|	СУММА(ДенежныеСредства.СуммаПриход) КАК Выручка
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ВЫБОР
	|				КОГДА &ИспользоватьОтборПоКассам
	|					ТОГДА СчетКасса В (&СписокКассДляВыручки)
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ДенежныеСредства
	|
	|ГДЕ
	|   НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВнутреннееПеремещениеДенежныхСредств
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ДенежныеСредства.Период, ДЕНЬ)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ) КАК Дата,
	|	КОЛИЧЕСТВО	(1) КАК КоличествоМонтажей
	|ИЗ
	|	РегистрСведений.Монтажи КАК Монтажи
	|ГДЕ
	|	Монтажи.Дата >= &НачалоПериода
	|	И Монтажи.Дата <= &КонецПериода		
	|   И Монтажи.Монтаж.ВидМонтажа = Значение(Справочник.ВидыМонтажа.Монтаж)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ) КАК Дата,
	|	КОЛИЧЕСТВО	(1) КАК Количество
	|ИЗ
	|	РегистрСведений.Монтажи КАК Монтажи
	|ГДЕ
	|	Монтажи.Дата >= &НачалоПериода
	|	И Монтажи.Дата <= &КонецПериода
	|	И Монтажи.Монтаж.ВидМонтажа = Значение(Справочник.ВидыМонтажа.СервиснаяЗаявка)
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ)	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ) КАК Дата,
	|	КОЛИЧЕСТВО	(1) КАК Количество
	|ИЗ
	|	РегистрСведений.Монтажи КАК Монтажи
	|ГДЕ
	|	Монтажи.Дата >= &НачалоПериода
	|	И Монтажи.Дата <= &КонецПериода
	|	И Монтажи.Монтаж.ВидМонтажа = Значение(Справочник.ВидыМонтажа.Рекламация)
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ				
	|	КОЛИЧЕСТВО	(1) КАК КоличествоЗамеров,
	|	НАЧАЛОПЕРИОДА(Замеры.Дата, ДЕНЬ) КАК Дата
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Дата >= &НачалоПериода
	|	И Замеры.Дата <= &КонецПериода		
	|	И Замеры.ЗамерВыполнен
	|	И НЕ Замеры.ЭтоВыезд
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Замеры.Дата, ДЕНЬ)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ				
	|	КОЛИЧЕСТВО	(1) КАК КоличествоЗамеров,
	|	НАЧАЛОПЕРИОДА(Замеры.Дата, ДЕНЬ) КАК Дата
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Дата >= &НачалоПериода
	|	И Замеры.Дата <= &КонецПериода		
	|	И Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ЗамерОтменен)
	|	И НЕ Замеры.ЭтоВыезд
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Замеры.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ) КАК Дата,
	//|	НАЧАЛОПЕРИОДА(Монтажи.Монтаж.Дата, ДЕНЬ) КАК Дата,
	|	НАЧАЛОПЕРИОДА(Монтажи.Монтаж.ДатаВыполнения, ДЕНЬ) КАК Дата,
	|	СУММА(Монтажи.СуммаДокумента) КАК СуммаМонтажей
	|ИЗ
	|	РегистрСведений.Монтажи КАК Монтажи
	|ГДЕ
	//++ #12853
	//|	Монтажи.Дата >= &НачалоПериода
	//|	И Монтажи.Дата <= &КонецПериода
	
	//#12853 монтажи в отчеты должны попадать не по дате документа, а по дате выполнения
	//|	Монтажи.Монтаж.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	Монтажи.Монтаж.ДатаВыполнения МЕЖДУ &НачалоПериода И &КонецПериода
	//-- #12853
	|	И Монтажи.Монтаж.ВидМонтажа = Значение(Справочник.ВидыМонтажа.Монтаж)
	|	И Монтажи.ИндексСтроки <= 1
	//++ #12853
	//|	И ВЫБОР 
	//|			КОГДА Монтажи.Монтаж.СозданПриИспользованииСтатусаЗакрыт
	//|				ТОГДА Монтажи.Монтаж.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт)
	//|			ИНАЧЕ Монтажи.Монтаж.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Выполнен)
	//|		КОНЕЦ
	|	И Монтажи.Монтаж.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Выполнен), ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Закрыт))
	//-- #12853
	|
	|СГРУППИРОВАТЬ ПО
	//|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ)
	//|	НАЧАЛОПЕРИОДА(Монтажи.Монтаж.Дата, ДЕНЬ)
	|	НАЧАЛОПЕРИОДА(Монтажи.Монтаж.ДатаВыполнения, ДЕНЬ)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ) КАК Дата,
	|	СУММА(Монтажи.СуммаДокумента) КАК СуммаЗаявок
	|ИЗ
	|	РегистрСведений.Монтажи КАК Монтажи
	|ГДЕ
	|	Монтажи.Дата >= &НачалоПериода
	|	И Монтажи.Дата <= &КонецПериода
	|	И Монтажи.Монтаж.ВидМонтажа = Значение(Справочник.ВидыМонтажа.СервиснаяЗаявка)
	|	И Монтажи.ИндексСтроки <= 1 
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Монтажи.Дата, ДЕНЬ)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ				
	|	КОЛИЧЕСТВО	(1) КАК КоличествоЗамеров,
	|	НАЧАЛОПЕРИОДА(Замеры.Дата, ДЕНЬ) КАК Дата
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Дата >= &НачалоПериода
	|	И Замеры.Дата <= &КонецПериода		
	|	И Замеры.Результат = Значение(Справочник.РезультатЗамераЛида.ПустаяСсылка)
	|	И НЕ Замеры.ЭтоВыезд
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Замеры.Дата, ДЕНЬ)
	|;
	|";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТЗНовые = РезультатЗапроса[0].Выгрузить();
	ТЗОтказ = РезультатЗапроса[1].Выгрузить();
	ТЗНецелевые = РезультатЗапроса[2].Выгрузить();
	ТЗЦелевые = РезультатЗапроса[3].Выгрузить();
	ТЗЗамеры = РезультатЗапроса[4].Выгрузить();
	ТЗЗамерыВЭтотДень = РезультатЗапроса[5].Выгрузить();
	ТЗДоговоры = РезультатЗапроса[6].Выгрузить();
	ТЗВыручка = РезультатЗапроса[7].Выгрузить();
	ТЗМонтажи = РезультатЗапроса[8].Выгрузить();
	ТЗСервис = РезультатЗапроса[9].Выгрузить();
	ТЗРекламация = РезультатЗапроса[10].Выгрузить();
	ТЗВыполненныеЗамеры = РезультатЗапроса[11].Выгрузить();
	ТЗОтмененныеЗамеры = РезультатЗапроса[12].Выгрузить();
	ТЗСуммаМонтажей = РезультатЗапроса[13].Выгрузить();
	ТЗСуммаСервисныхЗаявок = РезультатЗапроса[14].Выгрузить();
	ТЗЗамерыВРаботе = РезультатЗапроса[15].Выгрузить();
	
	Для Сч = 1 По 7 Цикл
		
		СоответствиеДат.Добавить(ТДата);
		
		// дни и дни недели
		Элементы["ГруппаПоказателиДень"+Сч].Заголовок = Формат(ТДата, "ДФ='дд ММММ'");
		Элементы["ДекорацияЗначениеДень"+Сч].Заголовок = Формат(ТДата, "ДФ=дддд");
		
		// новые лиды
		НайденныеСтроки = ТЗНовые.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		НовыеЛиды = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Статус, 0);
		Элементы["ДекорацияЗначениеНовыеЛиды"+Сч].Заголовок = НовыеЛиды;
		
		// отказ - лиды
		НайденныеСтроки = ТЗОтказ.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		ОтказЛиды = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Статус, 0);
		Элементы["ДекорацияЗначениеОтказы"+Сч].Заголовок = ОтказЛиды;
		
		// не целевой - лиды
		НайденныеСтроки = ТЗНецелевые.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		НецелевыеЛиды = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Статус, 0);
		Элементы["ДекорацияЗначениеНецелевые"+Сч].Заголовок = НецелевыеЛиды;
		
		// целевой - лиды
		НайденныеСтроки = ТЗЦелевые.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		ЦелевыеЛиды = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Статус, 0);
		Элементы["ДекорацияЗначениеЦелевые"+Сч].Заголовок = ЦелевыеЛиды;
		
		// созданные замеры (назначенные в этот же день)
		НайденныеСтроки = ТЗЗамерыВЭтотДень.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		ЗамерыВЭтотДень = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].КоличествоЗамеров, 0);
		Элементы["ДекорацияЗначениеЗамерыВЭтотДень"+Сч].Заголовок = ЗамерыВЭтотДень;
		
		// замеры
		НайденныеСтроки = ТЗЗамеры.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		Замеры = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].КоличествоЗамеров, 0);
		Элементы["ДекорацияЗначениеЗамеры"+Сч].Заголовок = Замеры;
		
		// выполненные замеры
		НайденныеСтроки = ТЗВыполненныеЗамеры.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		ВыполненныеЗамеры = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].КоличествоЗамеров, 0);
		Элементы["ДекорацияЗначениеЗамерыВыполнены"+Сч].Заголовок = ВыполненныеЗамеры;
		
		// замеры в работе
		НайденныеСтроки = ТЗЗамерыВРаботе.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		ЗамерыВРаботе = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].КоличествоЗамеров, 0);
		Элементы["ДекорацияЗначениеЗамерыВРаботе"+Сч].Заголовок = ЗамерыВРаботе;
		
		// отмененные замеры
		НайденныеСтроки = ТЗОтмененныеЗамеры.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		ОтмененныеЗамеры = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].КоличествоЗамеров, 0);
		Элементы["ДекорацияЗначениеЗамерыОтменены"+Сч].Заголовок = ОтмененныеЗамеры;
		
		// договоры
		НайденныеСтроки = ТЗДоговоры.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		Договоры = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].КоличествоДоговоров, 0);
		ДоговорыСумма = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].СуммаДоговоров, 0);
		Элементы["ДекорацияЗначениеДоговоры"+Сч].Заголовок = Договоры;
		Элементы["ДекорацияЗначениеДоговорыСумма"+Сч].Заголовок = Формат(ДоговорыСумма, "ЧДЦ=2; ЧРГ=; ЧН=0");
		
		// выручка
		НайденныеСтроки = ТЗВыручка.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		Выручка = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Выручка, 0);
		Элементы["ДекорацияЗначениеВыручка"+Сч].Заголовок = Формат(Выручка, "ЧДЦ=2; ЧРГ=; ЧН=0");
		
		// монтажи
		НайденныеСтроки = ТЗМонтажи.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		КоличествоМонтажей = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].КоличествоМонтажей, 0);
		Элементы["ДекорацияЗначениеМонтажи"+Сч].Заголовок = КоличествоМонтажей;
		
		// Монтаж Сервис
		НайденныеСтроки = ТЗСервис.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		КоличествоСервис = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Количество, 0);
		Элементы["ДекорацияЗначениеСервис"+Сч].Заголовок = КоличествоСервис;
		
		// Монтаж Рекламация
		НайденныеСтроки = ТЗРекламация.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		КоличествоРекламаций = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Количество, 0);
		Элементы["ДекорацияЗначениеРекламация"+Сч].Заголовок = КоличествоРекламаций;
		
		// Сумма монтажей
		НайденныеСтроки = ТЗСуммаМонтажей.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		СуммаМонтажей = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].СуммаМонтажей, 0);
		Элементы["ДекорацияЗначениеСуммаМонтажей"+Сч].Заголовок = СуммаМонтажей;

		// Сумма сервисных заявок
		НайденныеСтроки = ТЗСуммаСервисныхЗаявок.НайтиСтроки(Новый Структура("Дата", ТДата)); 
		СуммаЗаявок = ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].СуммаЗаявок, 0);
		Элементы["ДекорацияЗначениеСуммаСервисныхЗаявок"+Сч].Заголовок = СуммаЗаявок;
		
		ТДата = ТДата + 86400;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОтчет(Команда)
	
	ОткрытьФорму("Отчет.ПульсБизнесаРозница.ФормаОбъекта");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаРасшифровкиПоказателей

&НаКлиенте
Процедура ДекорацияЗначениеНажатие(Элемент)
	
	// пример: Элемент.Имя = ДекорацияЗначениеСервис6
	ИмяЭлемента = СтрЗаменить(Элемент.Имя, "ДекорацияЗначение", "");
	НомерКолонки = Число(Прав(ИмяЭлемента, 1));
	Показатель = Лев(ИмяЭлемента, СтрДлина(ИмяЭлемента) - 1);
	
	ИмяВариантаОтчета = "Отчет.ПульсБизнесаРозница.ПоРегистратору";	
	ВариантОтчета = ВариантОтчетаПоПолномуИмени(ИмяВариантаОтчета);
	Если ВариантОтчета=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеПоказателей = НОвый Соответствие;
	СоответствиеПоказателей.Вставить("НовыеЛиды", 		1);
	СоответствиеПоказателей.Вставить("Нецелевые", 		2);
	СоответствиеПоказателей.Вставить("Целевые", 		3);
	СоответствиеПоказателей.Вставить("Отказы", 			4);
	СоответствиеПоказателей.Вставить("ЗамерыВЭтотДень", 5);
	СоответствиеПоказателей.Вставить("Замеры", 			6);
	СоответствиеПоказателей.Вставить("ЗамерыВыполнены", 7);
	СоответствиеПоказателей.Вставить("ЗамерыВРаботе", 	8);
	СоответствиеПоказателей.Вставить("ЗамерыОтменены", 	9);	
	СоответствиеПоказателей.Вставить("Договоры", 		10);
	СоответствиеПоказателей.Вставить("Монтажи", 		11);
	СоответствиеПоказателей.Вставить("Сервис", 			12);
	СоответствиеПоказателей.Вставить("Рекламация", 		13);
	СоответствиеПоказателей.Вставить("ДоговорыСумма", 	14);
	СоответствиеПоказателей.Вставить("СуммаМонтажей",	15);
	СоответствиеПоказателей.Вставить("СуммаСервисныхЗаявок",	16);
	СоответствиеПоказателей.Вставить("Выручка", 		17);
	
	ПериодРасшифровки = Новый СтандартныйПериод();
	ПериодРасшифровки.ДатаНачала    = СоответствиеДат.Получить(НомерКолонки-1).Значение;
	ПериодРасшифровки.ДатаОкончания = ПериодРасшифровки.ДатаНачала;
	ОтборРасшифровки = Новый Соответствие;	
	ОтборРасшифровки.Вставить("Период", ПериодРасшифровки);
	
	СтруктураЗначения = Новый Структура;
	СтруктураЗначения.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
	СтруктураЗначения.Вставить("ПравоеЗначение", СоответствиеПоказателей.Получить(Показатель));
	ОтборРасшифровки.Вставить("ПриоритетПоказателя", СтруктураЗначения);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина); 
	ПараметрыФормы.Вставить("ОтборРасшифровки", ОтборРасшифровки);
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(ЭтаФорма, ВариантОтчета, ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Возвращает ссылку на вариант отчета.
//
// Параметры:
//  ПолноеИмя - полное имя отчета, включающее имя варианта, отделенное точкой. Пример: Отчеты.Продажи.Основной
//
// Возвращаемое значение:
//  СправочникСсылка.ВариантыОтчетов, Неопределено - вариант отчета, 
//          либо Неопределено, если отчет отсутствует или недоступен по правам.
//
Функция ВариантОтчетаПоПолномуИмени(ПолноеИмя)
	
	Если ПустаяСтрока(ПолноеИмя) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".");
	Если ЧастиИмени.Количество()<>3 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат ВариантыОтчетов.ПолучитьСсылку(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.НайтиПоПолномуИмени(ЧастиИмени[0] + "." + ЧастиИмени[1])), ЧастиИмени[2]);
	
КонецФункции

#КонецОбласти

#Область УДАЛИТЬ_ОбработкаРасшифровкиПоказателей

&НаКлиенте
Процедура ДекорацияЗначениеНовыеЛиды1Нажатие(Элемент)
	ОткрытьСписокЛидов(1, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНовыеЛиды2Нажатие(Элемент)
	ОткрытьСписокЛидов(2, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНовыеЛиды3Нажатие(Элемент)
	ОткрытьСписокЛидов(3, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНовыеЛиды4Нажатие(Элемент)
	ОткрытьСписокЛидов(4, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНовыеЛиды5Нажатие(Элемент)
	ОткрытьСписокЛидов(5, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНовыеЛиды6Нажатие(Элемент)
	ОткрытьСписокЛидов(6, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНовыеЛиды7Нажатие(Элемент)
	ОткрытьСписокЛидов(7, 1);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЛидов(День, Статус)
	
	МассивОтборов = новый Массив;
	
	//++ №10969 комментируем, т.к. меняем отбор по отказным и не целевым (сразу получаем ссылки из регистра "История лида")
	//Если Статус = 2 Тогда
	//	МассивОтборов.Добавить(новый Структура("Поле, Значение, ВидСравнения", "ТекущийСтатус", ПредопределенноеЗначение("Справочник.СтатусыЛида.Отказ"), ВидСравненияКомпоновкиДанных.Равно));
	//ИначеЕсли Статус = 3 Тогда
	//	МассивОтборов.Добавить(новый Структура("Поле, Значение, ВидСравнения", "ТекущийСтатус", ПредопределенноеЗначение("Справочник.СтатусыЛида.НеЦелевой"), ВидСравненияКомпоновкиДанных.Равно));	
	//КонецЕсли;
	//-- №10969
	
	ТДата = НачалоДня(ТекущаяДата() - 6*86400);
	ТДата = ТДата + ((День-1) * 86400);
	
	Если Статус = 1 Тогда // №10969 добавлено условие, по дате нужно отбирать только в этом статусе
		
		МассивОтборов.Добавить(новый Структура("Поле, Значение, ВидСравнения", "Дата", ТДата, ВидСравненияКомпоновкиДанных.БольшеИлиРавно));
		МассивОтборов.Добавить(новый Структура("Поле, Значение, ВидСравнения", "Дата", КонецДня(ТДата), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно));
		
	//++ №10969 меняем отбор по отказным и не целевым (сразу получаем ссылки из регистра "История лида")
	Иначе
		ПолучитьСсылкиНаЛидыВСтатусе(Статус, МассивОтборов, ТДата);
	КонецЕсли;
	//-- №10969
	
	ОткрытьФорму("Документ.Лид.ФормаСписка", новый Структура("ФиксированныеНастройки", ЗаполнитьПараметрыОткрытияСписка(МассивОтборов)), ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьСсылкиНаЛидыВСтатусе(Статус, МассивОтборов, Дата)
	
	ОтборСтатус = ?(Статус = 2, Справочники.СтатусыЛида.Отказ, Справочники.СтатусыЛида.НеЦелевой);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияСтатусовЛидов.Лид КАК Лид
	|ИЗ
	|	РегистрСведений.ИсторияСтатусовЛидов КАК ИсторияСтатусовЛидов
	|ГДЕ
	|	ИсторияСтатусовЛидов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИсторияСтатусовЛидов.Статус = &Статус
	|";
	Запрос.УстановитьПараметр("НачалоПериода", Дата);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Дата));
	Запрос.УстановитьПараметр("Статус", ОтборСтатус);
	
	МассивОтборов.Добавить(новый Структура("Поле, Значение, ВидСравнения", "Ссылка", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Лид"), ВидСравненияКомпоновкиДанных.ВСписке));
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьПараметрыОткрытияСписка(МассивОтборов)
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;	

	Для Каждого ТекущийОтбор Из МассивОтборов Цикл
		
		Элт = КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Элт.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТекущийОтбор.Поле);
		Элт.ВидСравнения = ТекущийОтбор.ВидСравнения;
		Элт.Использование = Истина;
		Элт.ПравоеЗначение = ТекущийОтбор.Значение;
		
	КонецЦикла;	

	Возврат КомпоновщикНастроек.ФиксированныеНастройки

КонецФункции

&НаКлиенте
Процедура ДекорацияЗначениеОтказы1Нажатие(Элемент)
	ОткрытьСписокЛидов(1, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеОтказы2Нажатие(Элемент)
	ОткрытьСписокЛидов(2, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеОтказы3Нажатие(Элемент)
	ОткрытьСписокЛидов(3, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеОтказы4Нажатие(Элемент)
	ОткрытьСписокЛидов(4, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеОтказы5Нажатие(Элемент)
	ОткрытьСписокЛидов(5, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеОтказы6Нажатие(Элемент)
	ОткрытьСписокЛидов(6, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеОтказы7Нажатие(Элемент)
	ОткрытьСписокЛидов(7, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНецелевые1Нажатие(Элемент)
	ОткрытьСписокЛидов(1, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНецелевые2Нажатие(Элемент)
	ОткрытьСписокЛидов(2, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНецелевые3Нажатие(Элемент)
	ОткрытьСписокЛидов(3, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНецелевые4Нажатие(Элемент)
	ОткрытьСписокЛидов(4, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНецелевые5Нажатие(Элемент)
	ОткрытьСписокЛидов(5, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНецелевые6Нажатие(Элемент)
	ОткрытьСписокЛидов(6, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеНецелевые7Нажатие(Элемент)
	ОткрытьСписокЛидов(7, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВЭтотДень1Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВЭтотДень2Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВЭтотДень3Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(3, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВЭтотДень4Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(4, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВЭтотДень5Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВЭтотДень6Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(6, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВЭтотДень7Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(7, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЛидовПоЗамерам(День, ЭтотДень = Ложь, Отбор = Неопределено)
	
	ТДата = НачалоДня(ТекущаяДата() - 6*86400);
	ТДата = ТДата + ((День-1) * 86400);
	
	СписокЛидов = ПолучитьСписокЛидовПоЗамерам(ТДата, ЭтотДень, Отбор);	
	
	МассивОтборов = новый Массив;	
	МассивОтборов.Добавить(новый Структура("Поле, Значение, ВидСравнения", "Ссылка", СписокЛидов, ВидСравненияКомпоновкиДанных.ВСписке));	
	
	ОткрытьФорму("Документ.Лид.ФормаСписка", новый Структура("ФиксированныеНастройки", ЗаполнитьПараметрыОткрытияСписка(МассивОтборов)), ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЛидовПоЗамерам(ТДата, ЭтотДень, Отбор)
	
	Выполненные = Ложь;
	Отмененные = Ложь;
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Выполненные = Отбор.Свойство("Выполненные");
		Отмененные = Отбор.Свойство("Отмененные");
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ТДата);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТДата));	
	Запрос.УстановитьПараметр("ЭтотДень", ЭтотДень);	
	Запрос.УстановитьПараметр("Выполненные", Выполненные);
	Запрос.УстановитьПараметр("Отмененные", Отмененные);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
       |	Замеры.ДокументЗамер КАК ДокументЗамер
       |ИЗ
       |	РегистрСведений.Замеры КАК Замеры
       |ГДЕ
       |	ИСТИНА
       |	И ВЫБОР
       |			КОГДА &ЭтотДень
       |				ТОГДА НАЧАЛОПЕРИОДА(Замеры.ДатаНазначенияЗамера, ДЕНЬ) = &НачалоПериода
       |			ИНАЧЕ Замеры.Дата >= &НачалоПериода
       |					И Замеры.Дата <= &КонецПериода
       |		КОНЕЦ
       |	И ВЫБОР
       |			КОГДА &Выполненные
       |				ТОГДА Замеры.ЗамерВыполнен
       |			ИНАЧЕ ИСТИНА
       |		КОНЕЦ
       |	И ВЫБОР
       |			КОГДА &Отмененные
       |				ТОГДА Замеры.Результат = ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен)
       |			ИНАЧЕ ИСТИНА
       |		КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументЗамер");
	
КонецФункции

&НаКлиенте
Процедура ДекорацияЗначениеЗамеры1Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамеры2Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамеры3Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамеры4Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(4);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамеры5Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(5);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамеры6Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(6);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамеры7Нажатие(Элемент)
	ОткрытьСписокЛидовПоЗамерам(7);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговоры1Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговоры2Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговоры3Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговоры4Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(4);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговоры5Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(5);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговоры6Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(6);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговоры7Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(7);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговорыСумма1Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговорыСумма2Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговорыСумма3Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговорыСумма4Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(4);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговорыСумма5Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(5);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговорыСумма6Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(6);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеДоговорыСумма7Нажатие(Элемент)
	ОткрытьСписокЗаказДоговоров(7);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗаказДоговоров(День)
	
	ТДата = НачалоДня(ТекущаяДата() - 6*86400);
	ТДата = ТДата + ((День-1) * 86400);
	
	СписокДоговоров = ПолучитьСписокДоговоров(ТДата);	
	
	МассивОтборов = новый Массив;	
	МассивОтборов.Добавить(новый Структура("Поле, Значение, ВидСравнения", "Ссылка", СписокДоговоров, ВидСравненияКомпоновкиДанных.ВСписке));	
	
	ОткрытьФорму("Документ.ЗаказДоговор.ФормаСписка", новый Структура("ФиксированныеНастройки", ЗаполнитьПараметрыОткрытияСписка(МассивОтборов)), ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоговоров(ТДата)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ТДата);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТДата));		
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаказДоговоры.Ссылка		
		|ИЗ
		|	Документ.ЗаказДоговор КАК ЗаказДоговоры
		|ГДЕ
		|	ЗаказДоговоры.Дата >= &НачалоПериода
		|	И ЗаказДоговоры.Дата <= &КонецПериода
		|	И ЗаказДоговоры.Проведен";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ДекорацияЗначениеМонтажи1Нажатие(Элемент)
	ОткрытьСписокМонтажей(1, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеМонтажи2Нажатие(Элемент)
	ОткрытьСписокМонтажей(2, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеМонтажи3Нажатие(Элемент)
	ОткрытьСписокМонтажей(3, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеМонтажи4Нажатие(Элемент)
	ОткрытьСписокМонтажей(4, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеМонтажи5Нажатие(Элемент)
	ОткрытьСписокМонтажей(5, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеМонтажи6Нажатие(Элемент)
	ОткрытьСписокМонтажей(6, 1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеМонтажи7Нажатие(Элемент)
	ОткрытьСписокМонтажей(7, 1);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокМонтажей(День, ВидМонтажа)
	
	ТДата = НачалоДня(ТекущаяДата() - 6*86400);
	ТДата = ТДата + ((День-1) * 86400);
		
	СписокМонтажей = ПолучитьСписокМонтажей(ТДата, ВидМонтажа);	
	
	МассивОтборов = новый Массив;	
	МассивОтборов.Добавить(новый Структура("Поле, Значение, ВидСравнения", "Ссылка", СписокМонтажей, ВидСравненияКомпоновкиДанных.ВСписке));	
	
	ОткрытьФорму("Документ.Монтаж.ФормаСписка", новый Структура("ФиксированныеНастройки", ЗаполнитьПараметрыОткрытияСписка(МассивОтборов)), ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокМонтажей(ТДата, ВидМонтажа)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ТДата);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТДата));
	Запрос.УстановитьПараметр("ВидМонтажа", ВидМонтажа);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Монтажи.Монтаж КАК Ссылка		
		|ИЗ
		|	РегистрСведений.Монтажи КАК Монтажи
		|ГДЕ
		|	Монтажи.Дата >= &НачалоПериода
		|	И Монтажи.Дата <= &КонецПериода
		|	И ВЫБОР
		|     	КОГДА &ВидМонтажа = 2 
		|			ТОГДА Монтажи.Монтаж.ВидМонтажа = Значение(Справочник.ВидыМонтажа.СервиснаяЗаявка)
		|		КОГДА &ВидМонтажа = 3 
		|			ТОГДА Монтажи.Монтаж.ВидМонтажа = Значение(Справочник.ВидыМонтажа.Рекламация)
		|		ИНАЧЕ Монтажи.Монтаж.ВидМонтажа = Значение(Справочник.ВидыМонтажа.Монтаж)
		|	КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ДекорацияЗначениеСервис1Нажатие(Элемент)
	ОткрытьСписокМонтажей(1, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеСервис2Нажатие(Элемент)
	ОткрытьСписокМонтажей(2, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеСервис3Нажатие(Элемент)
	ОткрытьСписокМонтажей(3, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеСервис4Нажатие(Элемент)
	ОткрытьСписокМонтажей(4, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеСервис5Нажатие(Элемент)
	ОткрытьСписокМонтажей(5, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеСервис6Нажатие(Элемент)
	ОткрытьСписокМонтажей(6, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеСервис7Нажатие(Элемент)
	ОткрытьСписокМонтажей(7, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеРекламация1Нажатие(Элемент)
	ОткрытьСписокМонтажей(1, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеРекламация2Нажатие(Элемент)
	ОткрытьСписокМонтажей(2, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеРекламация3Нажатие(Элемент)
	ОткрытьСписокМонтажей(3, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеРекламация4Нажатие(Элемент)
	ОткрытьСписокМонтажей(4, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеРекламация5Нажатие(Элемент)
	ОткрытьСписокМонтажей(5, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеРекламация6Нажатие(Элемент)
	ОткрытьСписокМонтажей(6, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеРекламация7Нажатие(Элемент)
	ОткрытьСписокМонтажей(7, 3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеВыручка1Нажатие(Элемент)
	ОткрытьСписокВыручка(1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеВыручка2Нажатие(Элемент)
	ОткрытьСписокВыручка(2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеВыручка3Нажатие(Элемент)
	ОткрытьСписокВыручка(3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеВыручка4Нажатие(Элемент)
	ОткрытьСписокВыручка(4);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеВыручка5Нажатие(Элемент)
	ОткрытьСписокВыручка(5);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеВыручка6Нажатие(Элемент)
	ОткрытьСписокВыручка(6);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеВыручка7Нажатие(Элемент)
	ОткрытьСписокВыручка(7);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокВыручка(День)
	           	
	ТДата = НачалоДня(ТекущаяДата() - 6*86400);
	ТДата = ТДата + ((День-1) * 86400);
		
	СписокВыручка = ПолучитьСписокВыручка(ТДата);	
	
	МассивОтборов = новый Массив;	
	МассивОтборов.Добавить(новый Структура("Поле, Значение, ВидСравнения", "Ссылка", СписокВыручка, ВидСравненияКомпоновкиДанных.ВСписке));	
	
	ОткрытьФорму("ЖурналДокументов.ОбщийЖурналДокументов.ФормаСписка", новый Структура("ФиксированныеНастройки", ЗаполнитьПараметрыОткрытияСписка(МассивОтборов)), ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыручка(ТДата)
	
	СписокКассДляВыручки = Новый СписокЗначений;
	Для каждого СтрокаКассы из НастройкаМонитора.КассыДляОтбораВВыручку Цикл
		СписокКассДляВыручки.Добавить(СтрокаКассы.Касса);
	КонецЦикла;	
	ИспользоватьОтборПоКассам = СписокКассДляВыручки.Количество() > 0;

	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ТДата);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТДата));
	Запрос.УстановитьПараметр("СписокКассДляВыручки", СписокКассДляВыручки);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоКассам", ИспользоватьОтборПоКассам);	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	ДенежныеСредства.Регистратор КАК Ссылка		
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			ВЫБОР
		|				КОГДА &ИспользоватьОтборПоКассам
		|					ТОГДА СчетКасса В (&СписокКассДляВыручки)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ) КАК ДенежныеСредства";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСписокВыполненныхЛидовПоЗамерам(День)
	
	ОткрытьСписокЛидовПоЗамерам(День,, новый Структура("Выполненные"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВыполнены1Нажатие(Элемент)
	ОткрытьСписокВыполненныхЛидовПоЗамерам(1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВыполнены2Нажатие(Элемент)
	ОткрытьСписокВыполненныхЛидовПоЗамерам(2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВыполнены3Нажатие(Элемент)
	ОткрытьСписокВыполненныхЛидовПоЗамерам(3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВыполнены4Нажатие(Элемент)
	ОткрытьСписокВыполненныхЛидовПоЗамерам(4);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВыполнены5Нажатие(Элемент)
	ОткрытьСписокВыполненныхЛидовПоЗамерам(5);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВыполнены6Нажатие(Элемент)
	ОткрытьСписокВыполненныхЛидовПоЗамерам(6);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыВыполнены7Нажатие(Элемент)
	ОткрытьСписокВыполненныхЛидовПоЗамерам(7);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОтмененныхЛидовПоЗамерам(День)
	
	ОткрытьСписокЛидовПоЗамерам(День,, новый Структура("Отмененные"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыОтменены1Нажатие(Элемент)
	ОткрытьСписокОтмененныхЛидовПоЗамерам(1);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыОтменены2Нажатие(Элемент)
	ОткрытьСписокОтмененныхЛидовПоЗамерам(2);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыОтменены3Нажатие(Элемент)
	ОткрытьСписокОтмененныхЛидовПоЗамерам(3);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыОтменены4Нажатие(Элемент)
	ОткрытьСписокОтмененныхЛидовПоЗамерам(4);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыОтменены5Нажатие(Элемент)
	ОткрытьСписокОтмененныхЛидовПоЗамерам(5);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыОтменены6Нажатие(Элемент)
	ОткрытьСписокОтмененныхЛидовПоЗамерам(6);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗначениеЗамерыОтменены7Нажатие(Элемент)
	ОткрытьСписокОтмененныхЛидовПоЗамерам(7);
КонецПроцедуры

#КонецОбласти
